Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_cloudwatch_metric_alarm.iac-cloudwatch-ec2-cpu-usage has changed
~ resource "aws_cloudwatch_metric_alarm" "iac-cloudwatch-ec2-cpu-usage" {
        id                        = "cpu-utilization"
      + insufficient_data_actions = []
      + tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_instance.iac-ec2 has changed
~ resource "aws_instance" "iac-ec2" {
      ~ associate_public_ip_address          = false -> true
        id                                   = "i-08151ffcf77bdbdf3"
      + public_ip                            = "3.39.58.131"
        tags                                 = {
            "Name" = "iac-ec2"
        }
        # (26 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_route53_record.iac-route53 has changed
~ resource "aws_route53_record" "iac-route53" {
        id      = "Z02629952Z1ESWD7VTUX1_ec2.rhea-so.com_A"
        name    = "ec2.rhea-so.com"
        # (5 unchanged attributes hidden)
    }

  # aws_sns_topic.iac-sns-topic has changed
~ resource "aws_sns_topic" "iac-sns-topic" {
        id                                       = "arn:aws:sns:ap-northeast-2:264842458097:iac-sns-topic"
        name                                     = "iac-sns-topic"
      + tags                                     = {}
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.iac-cloudwatch-ec2-cpu-usage must be replaced
-/+ resource "aws_cloudwatch_metric_alarm" "iac-cloudwatch-ec2-cpu-usage" {
      ~ alarm_name                            = "cpu-utilization" -> "iac-cloudwatch-ec2-cpu-usage" # forces replacement
      ~ arn                                   = "arn:aws:cloudwatch:ap-northeast-2:264842458097:alarm:cpu-utilization" -> (known after apply)
      - datapoints_to_alarm                   = 0 -> null
      + evaluate_low_sample_count_percentiles = (known after apply)
      ~ id                                    = "cpu-utilization" -> (known after apply)
      - insufficient_data_actions             = [] -> null
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.iac-sns-topic-subscription will be created
+ resource "aws_sns_topic_subscription" "iac-sns-topic-subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "jeonghyeon.rhea@gmail.com"
      + endpoint_auto_confirms          = false
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ap-northeast-2:264842458097:iac-sns-topic"
    }

Plan: 2 to add, 0 to change, 1 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://52.78.144.248/lock?id=rhea-so-lab%252FInfrastructure-as-Code%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
